espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/spi1_mem_c_reg.h
/**
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SPI1_MEM_C_CMD_REG register
 *  SPI1 memory command register
 */
#define SPI1_MEM_C_CMD_REG (DR_REG_FLASH_SPI1_BASE + 0x0)
/** SPI1_MEM_C_MST_ST : RO; bitpos: [3:0]; default: 0;
 *  The current status of SPI1 master FSM.
 */
#define SPI1_MEM_C_MST_ST    0x0000000FU
#define SPI1_MEM_C_MST_ST_M  (SPI1_MEM_C_MST_ST_V << SPI1_MEM_C_MST_ST_S)
#define SPI1_MEM_C_MST_ST_V  0x0000000FU
#define SPI1_MEM_C_MST_ST_S  0
/** SPI1_MEM_C_SLV_ST : RO; bitpos: [7:4]; default: 0;
 *  The current status of SPI1 slave FSM: mspi_st. 0: idle state, 1: preparation state,
 *  2: send command state, 3: send address state, 4: wait state, 5: read data state,
 *  6:write data state, 7: done state, 8: read data end state.
 */
#define SPI1_MEM_C_SLV_ST    0x0000000FU
#define SPI1_MEM_C_SLV_ST_M  (SPI1_MEM_C_SLV_ST_V << SPI1_MEM_C_SLV_ST_S)
#define SPI1_MEM_C_SLV_ST_V  0x0000000FU
#define SPI1_MEM_C_SLV_ST_S  4
/** SPI1_MEM_C_FLASH_PE : R/W/SC; bitpos: [17]; default: 0;
 *  In user mode, it is set to indicate that program/erase operation will be triggered.
 *  The bit is combined with spi1_mem_c_usr bit. The bit will be cleared once the
 *  operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_PE    (BIT(17))
#define SPI1_MEM_C_FLASH_PE_M  (SPI1_MEM_C_FLASH_PE_V << SPI1_MEM_C_FLASH_PE_S)
#define SPI1_MEM_C_FLASH_PE_V  0x00000001U
#define SPI1_MEM_C_FLASH_PE_S  17
/** SPI1_MEM_C_USR : R/W/SC; bitpos: [18]; default: 0;
 *  User define command enable.  An operation will be triggered when the bit is set.
 *  The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_USR    (BIT(18))
#define SPI1_MEM_C_USR_M  (SPI1_MEM_C_USR_V << SPI1_MEM_C_USR_S)
#define SPI1_MEM_C_USR_V  0x00000001U
#define SPI1_MEM_C_USR_S  18
/** SPI1_MEM_C_FLASH_HPM : R/W/SC; bitpos: [19]; default: 0;
 *  Drive Flash into high performance mode.  The bit will be cleared once the operation
 *  done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_HPM    (BIT(19))
#define SPI1_MEM_C_FLASH_HPM_M  (SPI1_MEM_C_FLASH_HPM_V << SPI1_MEM_C_FLASH_HPM_S)
#define SPI1_MEM_C_FLASH_HPM_V  0x00000001U
#define SPI1_MEM_C_FLASH_HPM_S  19
/** SPI1_MEM_C_FLASH_RES : R/W/SC; bitpos: [20]; default: 0;
 *  This bit combined with reg_resandres bit releases Flash from the power-down state
 *  or high performance mode and obtains the devices ID. The bit will be cleared once
 *  the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_RES    (BIT(20))
#define SPI1_MEM_C_FLASH_RES_M  (SPI1_MEM_C_FLASH_RES_V << SPI1_MEM_C_FLASH_RES_S)
#define SPI1_MEM_C_FLASH_RES_V  0x00000001U
#define SPI1_MEM_C_FLASH_RES_S  20
/** SPI1_MEM_C_FLASH_DP : R/W/SC; bitpos: [21]; default: 0;
 *  Drive Flash into power down.  An operation will be triggered when the bit is set.
 *  The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_DP    (BIT(21))
#define SPI1_MEM_C_FLASH_DP_M  (SPI1_MEM_C_FLASH_DP_V << SPI1_MEM_C_FLASH_DP_S)
#define SPI1_MEM_C_FLASH_DP_V  0x00000001U
#define SPI1_MEM_C_FLASH_DP_S  21
/** SPI1_MEM_C_FLASH_CE : R/W/SC; bitpos: [22]; default: 0;
 *  Chip erase enable. Chip erase operation will be triggered when the bit is set. The
 *  bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_CE    (BIT(22))
#define SPI1_MEM_C_FLASH_CE_M  (SPI1_MEM_C_FLASH_CE_V << SPI1_MEM_C_FLASH_CE_S)
#define SPI1_MEM_C_FLASH_CE_V  0x00000001U
#define SPI1_MEM_C_FLASH_CE_S  22
/** SPI1_MEM_C_FLASH_BE : R/W/SC; bitpos: [23]; default: 0;
 *  Block erase enable(32KB) .  Block erase operation will be triggered when the bit is
 *  set. The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_BE    (BIT(23))
#define SPI1_MEM_C_FLASH_BE_M  (SPI1_MEM_C_FLASH_BE_V << SPI1_MEM_C_FLASH_BE_S)
#define SPI1_MEM_C_FLASH_BE_V  0x00000001U
#define SPI1_MEM_C_FLASH_BE_S  23
/** SPI1_MEM_C_FLASH_SE : R/W/SC; bitpos: [24]; default: 0;
 *  Sector erase enable(4KB). Sector erase operation will be triggered when the bit is
 *  set. The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_SE    (BIT(24))
#define SPI1_MEM_C_FLASH_SE_M  (SPI1_MEM_C_FLASH_SE_V << SPI1_MEM_C_FLASH_SE_S)
#define SPI1_MEM_C_FLASH_SE_V  0x00000001U
#define SPI1_MEM_C_FLASH_SE_S  24
/** SPI1_MEM_C_FLASH_PP : R/W/SC; bitpos: [25]; default: 0;
 *  Page program enable(1 byte ~256 bytes data to be programmed). Page program
 *  operation  will be triggered when the bit is set. The bit will be cleared once the
 *  operation done .1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_PP    (BIT(25))
#define SPI1_MEM_C_FLASH_PP_M  (SPI1_MEM_C_FLASH_PP_V << SPI1_MEM_C_FLASH_PP_S)
#define SPI1_MEM_C_FLASH_PP_V  0x00000001U
#define SPI1_MEM_C_FLASH_PP_S  25
/** SPI1_MEM_C_FLASH_WRSR : R/W/SC; bitpos: [26]; default: 0;
 *  Write status register enable.   Write status operation  will be triggered when the
 *  bit is set. The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_WRSR    (BIT(26))
#define SPI1_MEM_C_FLASH_WRSR_M  (SPI1_MEM_C_FLASH_WRSR_V << SPI1_MEM_C_FLASH_WRSR_S)
#define SPI1_MEM_C_FLASH_WRSR_V  0x00000001U
#define SPI1_MEM_C_FLASH_WRSR_S  26
/** SPI1_MEM_C_FLASH_RDSR : R/W/SC; bitpos: [27]; default: 0;
 *  Read status register-1.  Read status operation will be triggered when the bit is
 *  set. The bit will be cleared once the operation done.1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_RDSR    (BIT(27))
#define SPI1_MEM_C_FLASH_RDSR_M  (SPI1_MEM_C_FLASH_RDSR_V << SPI1_MEM_C_FLASH_RDSR_S)
#define SPI1_MEM_C_FLASH_RDSR_V  0x00000001U
#define SPI1_MEM_C_FLASH_RDSR_S  27
/** SPI1_MEM_C_FLASH_RDID : R/W/SC; bitpos: [28]; default: 0;
 *  Read JEDEC ID . Read ID command will be sent when the bit is set. The bit will be
 *  cleared once the operation done. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_RDID    (BIT(28))
#define SPI1_MEM_C_FLASH_RDID_M  (SPI1_MEM_C_FLASH_RDID_V << SPI1_MEM_C_FLASH_RDID_S)
#define SPI1_MEM_C_FLASH_RDID_V  0x00000001U
#define SPI1_MEM_C_FLASH_RDID_S  28
/** SPI1_MEM_C_FLASH_WRDI : R/W/SC; bitpos: [29]; default: 0;
 *  Write flash disable. Write disable command will be sent when the bit is set. The
 *  bit will be cleared once the operation done. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_WRDI    (BIT(29))
#define SPI1_MEM_C_FLASH_WRDI_M  (SPI1_MEM_C_FLASH_WRDI_V << SPI1_MEM_C_FLASH_WRDI_S)
#define SPI1_MEM_C_FLASH_WRDI_V  0x00000001U
#define SPI1_MEM_C_FLASH_WRDI_S  29
/** SPI1_MEM_C_FLASH_WREN : R/W/SC; bitpos: [30]; default: 0;
 *  Write flash enable.  Write enable command will be sent when the bit is set. The bit
 *  will be cleared once the operation done. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_WREN    (BIT(30))
#define SPI1_MEM_C_FLASH_WREN_M  (SPI1_MEM_C_FLASH_WREN_V << SPI1_MEM_C_FLASH_WREN_S)
#define SPI1_MEM_C_FLASH_WREN_V  0x00000001U
#define SPI1_MEM_C_FLASH_WREN_S  30
/** SPI1_MEM_C_FLASH_READ : R/W/SC; bitpos: [31]; default: 0;
 *  Read flash enable. Read flash operation will be triggered when the bit is set. The
 *  bit will be cleared once the operation done. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FLASH_READ    (BIT(31))
#define SPI1_MEM_C_FLASH_READ_M  (SPI1_MEM_C_FLASH_READ_V << SPI1_MEM_C_FLASH_READ_S)
#define SPI1_MEM_C_FLASH_READ_V  0x00000001U
#define SPI1_MEM_C_FLASH_READ_S  31

/** SPI1_MEM_C_ADDR_REG register
 *  SPI1 address register
 */
#define SPI1_MEM_C_ADDR_REG (DR_REG_FLASH_SPI1_BASE + 0x4)
/** SPI1_MEM_C_USR_ADDR_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  In user mode, it is the memory address. other then the bit0-bit23 is the memory
 *  address, the bit24-bit31 are the byte length of a transfer.
 */
#define SPI1_MEM_C_USR_ADDR_VALUE    0xFFFFFFFFU
#define SPI1_MEM_C_USR_ADDR_VALUE_M  (SPI1_MEM_C_USR_ADDR_VALUE_V << SPI1_MEM_C_USR_ADDR_VALUE_S)
#define SPI1_MEM_C_USR_ADDR_VALUE_V  0xFFFFFFFFU
#define SPI1_MEM_C_USR_ADDR_VALUE_S  0

/** SPI1_MEM_C_CTRL_REG register
 *  SPI1 control register.
 */
#define SPI1_MEM_C_CTRL_REG (DR_REG_FLASH_SPI1_BASE + 0x8)
/** SPI1_MEM_C_FDUMMY_RIN : R/W; bitpos: [2]; default: 1;
 *  In the dummy phase of a MSPI read data transfer when accesses to flash, the signal
 *  level of SPI bus is output by the MSPI controller.
 */
#define SPI1_MEM_C_FDUMMY_RIN    (BIT(2))
#define SPI1_MEM_C_FDUMMY_RIN_M  (SPI1_MEM_C_FDUMMY_RIN_V << SPI1_MEM_C_FDUMMY_RIN_S)
#define SPI1_MEM_C_FDUMMY_RIN_V  0x00000001U
#define SPI1_MEM_C_FDUMMY_RIN_S  2
/** SPI1_MEM_C_FDUMMY_WOUT : R/W; bitpos: [3]; default: 1;
 *  In the dummy phase of a MSPI write data transfer when accesses to flash, the signal
 *  level of SPI bus is output by the MSPI controller.
 */
#define SPI1_MEM_C_FDUMMY_WOUT    (BIT(3))
#define SPI1_MEM_C_FDUMMY_WOUT_M  (SPI1_MEM_C_FDUMMY_WOUT_V << SPI1_MEM_C_FDUMMY_WOUT_S)
#define SPI1_MEM_C_FDUMMY_WOUT_V  0x00000001U
#define SPI1_MEM_C_FDUMMY_WOUT_S  3
/** SPI1_MEM_C_FDOUT_OCT : HRO; bitpos: [4]; default: 0;
 *  Apply 8 signals during write-data phase 1:enable 0: disable
 */
#define SPI1_MEM_C_FDOUT_OCT    (BIT(4))
#define SPI1_MEM_C_FDOUT_OCT_M  (SPI1_MEM_C_FDOUT_OCT_V << SPI1_MEM_C_FDOUT_OCT_S)
#define SPI1_MEM_C_FDOUT_OCT_V  0x00000001U
#define SPI1_MEM_C_FDOUT_OCT_S  4
/** SPI1_MEM_C_FDIN_OCT : HRO; bitpos: [5]; default: 0;
 *  Apply 8 signals during read-data phase 1:enable 0: disable
 */
#define SPI1_MEM_C_FDIN_OCT    (BIT(5))
#define SPI1_MEM_C_FDIN_OCT_M  (SPI1_MEM_C_FDIN_OCT_V << SPI1_MEM_C_FDIN_OCT_S)
#define SPI1_MEM_C_FDIN_OCT_V  0x00000001U
#define SPI1_MEM_C_FDIN_OCT_S  5
/** SPI1_MEM_C_FADDR_OCT : HRO; bitpos: [6]; default: 0;
 *  Apply 8 signals during address phase 1:enable 0: disable
 */
#define SPI1_MEM_C_FADDR_OCT    (BIT(6))
#define SPI1_MEM_C_FADDR_OCT_M  (SPI1_MEM_C_FADDR_OCT_V << SPI1_MEM_C_FADDR_OCT_S)
#define SPI1_MEM_C_FADDR_OCT_V  0x00000001U
#define SPI1_MEM_C_FADDR_OCT_S  6
/** SPI1_MEM_C_FCMD_QUAD : R/W; bitpos: [8]; default: 0;
 *  Apply 4 signals during command phase 1:enable 0: disable
 */
#define SPI1_MEM_C_FCMD_QUAD    (BIT(8))
#define SPI1_MEM_C_FCMD_QUAD_M  (SPI1_MEM_C_FCMD_QUAD_V << SPI1_MEM_C_FCMD_QUAD_S)
#define SPI1_MEM_C_FCMD_QUAD_V  0x00000001U
#define SPI1_MEM_C_FCMD_QUAD_S  8
/** SPI1_MEM_C_FCMD_OCT : HRO; bitpos: [9]; default: 0;
 *  Apply 8 signals during command phase 1:enable 0: disable
 */
#define SPI1_MEM_C_FCMD_OCT    (BIT(9))
#define SPI1_MEM_C_FCMD_OCT_M  (SPI1_MEM_C_FCMD_OCT_V << SPI1_MEM_C_FCMD_OCT_S)
#define SPI1_MEM_C_FCMD_OCT_V  0x00000001U
#define SPI1_MEM_C_FCMD_OCT_S  9
/** SPI1_MEM_C_FCS_CRC_EN : HRO; bitpos: [10]; default: 0;
 *  For SPI1,  initialize crc32 module before writing encrypted data to flash. Active
 *  low.
 */
#define SPI1_MEM_C_FCS_CRC_EN    (BIT(10))
#define SPI1_MEM_C_FCS_CRC_EN_M  (SPI1_MEM_C_FCS_CRC_EN_V << SPI1_MEM_C_FCS_CRC_EN_S)
#define SPI1_MEM_C_FCS_CRC_EN_V  0x00000001U
#define SPI1_MEM_C_FCS_CRC_EN_S  10
/** SPI1_MEM_C_TX_CRC_EN : HRO; bitpos: [11]; default: 0;
 *  For SPI1,  enable crc32 when writing encrypted data to flash. 1: enable 0:disable
 */
#define SPI1_MEM_C_TX_CRC_EN    (BIT(11))
#define SPI1_MEM_C_TX_CRC_EN_M  (SPI1_MEM_C_TX_CRC_EN_V << SPI1_MEM_C_TX_CRC_EN_S)
#define SPI1_MEM_C_TX_CRC_EN_V  0x00000001U
#define SPI1_MEM_C_TX_CRC_EN_S  11
/** SPI1_MEM_C_FASTRD_MODE : R/W; bitpos: [13]; default: 1;
 *  This bit enable the bits: spi1_mem_c_fread_qio, spi1_mem_c_fread_dio, spi1_mem_c_fread_qout
 *  and spi1_mem_c_fread_dout. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FASTRD_MODE    (BIT(13))
#define SPI1_MEM_C_FASTRD_MODE_M  (SPI1_MEM_C_FASTRD_MODE_V << SPI1_MEM_C_FASTRD_MODE_S)
#define SPI1_MEM_C_FASTRD_MODE_V  0x00000001U
#define SPI1_MEM_C_FASTRD_MODE_S  13
/** SPI1_MEM_C_FREAD_DUAL : R/W; bitpos: [14]; default: 0;
 *  In the read operations, read-data phase apply 2 signals. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FREAD_DUAL    (BIT(14))
#define SPI1_MEM_C_FREAD_DUAL_M  (SPI1_MEM_C_FREAD_DUAL_V << SPI1_MEM_C_FREAD_DUAL_S)
#define SPI1_MEM_C_FREAD_DUAL_V  0x00000001U
#define SPI1_MEM_C_FREAD_DUAL_S  14
/** SPI1_MEM_C_RESANDRES : R/W; bitpos: [15]; default: 1;
 *  The Device ID is read out to SPI1_MEM_C_RD_STATUS register,  this bit combine with
 *  spi1_mem_c_flash_res bit. 1: enable 0: disable.
 */
#define SPI1_MEM_C_RESANDRES    (BIT(15))
#define SPI1_MEM_C_RESANDRES_M  (SPI1_MEM_C_RESANDRES_V << SPI1_MEM_C_RESANDRES_S)
#define SPI1_MEM_C_RESANDRES_V  0x00000001U
#define SPI1_MEM_C_RESANDRES_S  15
/** SPI1_MEM_C_Q_POL : R/W; bitpos: [18]; default: 1;
 *  The bit is used to set MISO line polarity, 1: high 0, low
 */
#define SPI1_MEM_C_Q_POL    (BIT(18))
#define SPI1_MEM_C_Q_POL_M  (SPI1_MEM_C_Q_POL_V << SPI1_MEM_C_Q_POL_S)
#define SPI1_MEM_C_Q_POL_V  0x00000001U
#define SPI1_MEM_C_Q_POL_S  18
/** SPI1_MEM_C_D_POL : R/W; bitpos: [19]; default: 1;
 *  The bit is used to set MOSI line polarity, 1: high 0, low
 */
#define SPI1_MEM_C_D_POL    (BIT(19))
#define SPI1_MEM_C_D_POL_M  (SPI1_MEM_C_D_POL_V << SPI1_MEM_C_D_POL_S)
#define SPI1_MEM_C_D_POL_V  0x00000001U
#define SPI1_MEM_C_D_POL_S  19
/** SPI1_MEM_C_FREAD_QUAD : R/W; bitpos: [20]; default: 0;
 *  In the read operations read-data phase apply 4 signals. 1: enable 0: disable.
 */
#define SPI1_MEM_C_FREAD_QUAD    (BIT(20))
#define SPI1_MEM_C_FREAD_QUAD_M  (SPI1_MEM_C_FREAD_QUAD_V << SPI1_MEM_C_FREAD_QUAD_S)
#define SPI1_MEM_C_FREAD_QUAD_V  0x00000001U
#define SPI1_MEM_C_FREAD_QUAD_S  20
/** SPI1_MEM_C_WP_REG : R/W; bitpos: [21]; default: 1;
 *  Write protect signal output when SPI is idle.  1: output high, 0: output low.
 */
#define SPI1_MEM_C_WP_REG    (BIT(21))
#define SPI1_MEM_C_WP_REG_M  (SPI1_MEM_C_WP_REG_V << SPI1_MEM_C_WP_REG_S)
#define SPI1_MEM_C_WP_REG_V  0x00000001U
#define SPI1_MEM_C_WP_REG_S  21
/** SPI1_MEM_C_WRSR_2B : R/W; bitpos: [22]; default: 0;
 *  two bytes data will be written to status register when it is set. 1: enable 0:
 *  disable.
 */
#define SPI1_MEM_C_WRSR_2B    (BIT(22))
#define SPI1_MEM_C_WRSR_2B_M  (SPI1_MEM_C_WRSR_2B_V << SPI1_MEM_C_WRSR_2B_S)
#define SPI1_MEM_C_WRSR_2B_V  0x00000001U
#define SPI1_MEM_C_WRSR_2B_S  22
/** SPI1_MEM_C_FREAD_DIO : R/W; bitpos: [23]; default: 0;
 *  In the read operations address phase and read-data phase apply 2 signals. 1: enable
 *  0: disable.
 */
#define SPI1_MEM_C_FREAD_DIO    (BIT(23))
#define SPI1_MEM_C_FREAD_DIO_M  (SPI1_MEM_C_FREAD_DIO_V << SPI1_MEM_C_FREAD_DIO_S)
#define SPI1_MEM_C_FREAD_DIO_V  0x00000001U
#define SPI1_MEM_C_FREAD_DIO_S  23
/** SPI1_MEM_C_FREAD_QIO : R/W; bitpos: [24]; default: 0;
 *  In the read operations address phase and read-data phase apply 4 signals. 1: enable
 *  0: disable.
 */
#define SPI1_MEM_C_FREAD_QIO    (BIT(24))
#define SPI1_MEM_C_FREAD_QIO_M  (SPI1_MEM_C_FREAD_QIO_V << SPI1_MEM_C_FREAD_QIO_S)
#define SPI1_MEM_C_FREAD_QIO_V  0x00000001U
#define SPI1_MEM_C_FREAD_QIO_S  24

/** SPI1_MEM_C_CTRL1_REG register
 *  SPI1 control1 register.
 */
#define SPI1_MEM_C_CTRL1_REG (DR_REG_FLASH_SPI1_BASE + 0xc)
/** SPI1_MEM_C_CLK_MODE : R/W; bitpos: [1:0]; default: 0;
 *  SPI clock mode bits. 0: SPI clock is off when CS inactive 1: SPI clock is delayed
 *  one cycle after CS inactive 2: SPI clock is delayed two cycles after CS inactive 3:
 *  SPI clock is always on.
 */
#define SPI1_MEM_C_CLK_MODE    0x00000003U
#define SPI1_MEM_C_CLK_MODE_M  (SPI1_MEM_C_CLK_MODE_V << SPI1_MEM_C_CLK_MODE_S)
#define SPI1_MEM_C_CLK_MODE_V  0x00000003U
#define SPI1_MEM_C_CLK_MODE_S  0
/** SPI1_MEM_C_CS_HOLD_DLY_RES : R/W; bitpos: [11:2]; default: 1023;
 *  After RES/DP/HPM command is sent, SPI1 waits (SPI1_MEM_C_CS_HOLD_DELAY_RES[9:0] * 512)
 *  SPI_CLK cycles.
 */
#define SPI1_MEM_C_CS_HOLD_DLY_RES    0x000003FFU
#define SPI1_MEM_C_CS_HOLD_DLY_RES_M  (SPI1_MEM_C_CS_HOLD_DLY_RES_V << SPI1_MEM_C_CS_HOLD_DLY_RES_S)
#define SPI1_MEM_C_CS_HOLD_DLY_RES_V  0x000003FFU
#define SPI1_MEM_C_CS_HOLD_DLY_RES_S  2

