espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/spi1_mem_c_reg.h
/** SPI1_MEM_C_USER1_REG register
 *  SPI1 user1 register.
 */
#define SPI1_MEM_C_USER1_REG (DR_REG_FLASH_SPI1_BASE + 0x1c)
/** SPI1_MEM_C_USR_DUMMY_CYCLELEN : R/W; bitpos: [5:0]; default: 7;
 *  The length in spi1_mem_c_clk cycles of dummy phase. The register value shall be
 *  (cycle_num-1).
 */
#define SPI1_MEM_C_USR_DUMMY_CYCLELEN    0x0000003FU
#define SPI1_MEM_C_USR_DUMMY_CYCLELEN_M  (SPI1_MEM_C_USR_DUMMY_CYCLELEN_V << SPI1_MEM_C_USR_DUMMY_CYCLELEN_S)
#define SPI1_MEM_C_USR_DUMMY_CYCLELEN_V  0x0000003FU
#define SPI1_MEM_C_USR_DUMMY_CYCLELEN_S  0
/** SPI1_MEM_C_USR_ADDR_BITLEN : R/W; bitpos: [31:26]; default: 23;
 *  The length in bits of address phase. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_C_USR_ADDR_BITLEN    0x0000003FU
#define SPI1_MEM_C_USR_ADDR_BITLEN_M  (SPI1_MEM_C_USR_ADDR_BITLEN_V << SPI1_MEM_C_USR_ADDR_BITLEN_S)
#define SPI1_MEM_C_USR_ADDR_BITLEN_V  0x0000003FU
#define SPI1_MEM_C_USR_ADDR_BITLEN_S  26

/** SPI1_MEM_C_USER2_REG register
 *  SPI1 user2 register.
 */
#define SPI1_MEM_C_USER2_REG (DR_REG_FLASH_SPI1_BASE + 0x20)
/** SPI1_MEM_C_USR_COMMAND_VALUE : R/W; bitpos: [15:0]; default: 0;
 *  The value of  command.
 */
#define SPI1_MEM_C_USR_COMMAND_VALUE    0x0000FFFFU
#define SPI1_MEM_C_USR_COMMAND_VALUE_M  (SPI1_MEM_C_USR_COMMAND_VALUE_V << SPI1_MEM_C_USR_COMMAND_VALUE_S)
#define SPI1_MEM_C_USR_COMMAND_VALUE_V  0x0000FFFFU
#define SPI1_MEM_C_USR_COMMAND_VALUE_S  0
/** SPI1_MEM_C_USR_COMMAND_BITLEN : R/W; bitpos: [31:28]; default: 7;
 *  The length in bits of command phase. The register value shall be (bit_num-1)
 */
#define SPI1_MEM_C_USR_COMMAND_BITLEN    0x0000000FU
#define SPI1_MEM_C_USR_COMMAND_BITLEN_M  (SPI1_MEM_C_USR_COMMAND_BITLEN_V << SPI1_MEM_C_USR_COMMAND_BITLEN_S)
#define SPI1_MEM_C_USR_COMMAND_BITLEN_V  0x0000000FU
#define SPI1_MEM_C_USR_COMMAND_BITLEN_S  28

/** SPI1_MEM_C_MOSI_DLEN_REG register
 *  SPI1 send data bit length control register.
 */
#define SPI1_MEM_C_MOSI_DLEN_REG (DR_REG_FLASH_SPI1_BASE + 0x24)
/** SPI1_MEM_C_USR_MOSI_DBITLEN : R/W; bitpos: [9:0]; default: 0;
 *  The length in bits of write-data. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_C_USR_MOSI_DBITLEN    0x000003FFU
#define SPI1_MEM_C_USR_MOSI_DBITLEN_M  (SPI1_MEM_C_USR_MOSI_DBITLEN_V << SPI1_MEM_C_USR_MOSI_DBITLEN_S)
#define SPI1_MEM_C_USR_MOSI_DBITLEN_V  0x000003FFU
#define SPI1_MEM_C_USR_MOSI_DBITLEN_S  0

/** SPI1_MEM_C_MISO_DLEN_REG register
 *  SPI1 receive data bit length control register.
 */
#define SPI1_MEM_C_MISO_DLEN_REG (DR_REG_FLASH_SPI1_BASE + 0x28)
/** SPI1_MEM_C_USR_MISO_DBITLEN : R/W; bitpos: [9:0]; default: 0;
 *  The length in bits of  read-data. The register value shall be (bit_num-1).
 */
#define SPI1_MEM_C_USR_MISO_DBITLEN    0x000003FFU
#define SPI1_MEM_C_USR_MISO_DBITLEN_M  (SPI1_MEM_C_USR_MISO_DBITLEN_V << SPI1_MEM_C_USR_MISO_DBITLEN_S)
#define SPI1_MEM_C_USR_MISO_DBITLEN_V  0x000003FFU
#define SPI1_MEM_C_USR_MISO_DBITLEN_S  0

/** SPI1_MEM_C_RD_STATUS_REG register
 *  SPI1 status register.
 */
#define SPI1_MEM_C_RD_STATUS_REG (DR_REG_FLASH_SPI1_BASE + 0x2c)
/** SPI1_MEM_C_STATUS : R/W/SS; bitpos: [15:0]; default: 0;
 *  The value is stored when set spi1_mem_c_flash_rdsr bit and spi1_mem_c_flash_res bit.
 */
#define SPI1_MEM_C_STATUS    0x0000FFFFU
#define SPI1_MEM_C_STATUS_M  (SPI1_MEM_C_STATUS_V << SPI1_MEM_C_STATUS_S)
#define SPI1_MEM_C_STATUS_V  0x0000FFFFU
#define SPI1_MEM_C_STATUS_S  0
/** SPI1_MEM_C_WB_MODE : R/W; bitpos: [23:16]; default: 0;
 *  Mode bits in the flash fast read mode  it is combined with spi1_mem_c_fastrd_mode bit.
 */
#define SPI1_MEM_C_WB_MODE    0x000000FFU
#define SPI1_MEM_C_WB_MODE_M  (SPI1_MEM_C_WB_MODE_V << SPI1_MEM_C_WB_MODE_S)
#define SPI1_MEM_C_WB_MODE_V  0x000000FFU
#define SPI1_MEM_C_WB_MODE_S  16

/** SPI1_MEM_C_MISC_REG register
 *  SPI1 misc register
 */
#define SPI1_MEM_C_MISC_REG (DR_REG_FLASH_SPI1_BASE + 0x34)
/** SPI1_MEM_C_CS0_DIS : R/W; bitpos: [0]; default: 0;
 *  SPI_CS0 pin enable, 1: disable SPI_CS0, 0: SPI_CS0 pin is active to select SPI
 *  device, such as flash, external RAM and so on.
 */
#define SPI1_MEM_C_CS0_DIS    (BIT(0))
#define SPI1_MEM_C_CS0_DIS_M  (SPI1_MEM_C_CS0_DIS_V << SPI1_MEM_C_CS0_DIS_S)
#define SPI1_MEM_C_CS0_DIS_V  0x00000001U
#define SPI1_MEM_C_CS0_DIS_S  0
/** SPI1_MEM_C_CS1_DIS : R/W; bitpos: [1]; default: 1;
 *  SPI_CS1 pin enable, 1: disable SPI_CS1, 0: SPI_CS1 pin is active to select SPI
 *  device, such as flash, external RAM and so on.
 */
#define SPI1_MEM_C_CS1_DIS    (BIT(1))
#define SPI1_MEM_C_CS1_DIS_M  (SPI1_MEM_C_CS1_DIS_V << SPI1_MEM_C_CS1_DIS_S)
#define SPI1_MEM_C_CS1_DIS_V  0x00000001U
#define SPI1_MEM_C_CS1_DIS_S  1
/** SPI1_MEM_C_CK_IDLE_EDGE : R/W; bitpos: [9]; default: 0;
 *  1: spi clk line is high when idle     0: spi clk line is low when idle
 */
#define SPI1_MEM_C_CK_IDLE_EDGE    (BIT(9))
#define SPI1_MEM_C_CK_IDLE_EDGE_M  (SPI1_MEM_C_CK_IDLE_EDGE_V << SPI1_MEM_C_CK_IDLE_EDGE_S)
#define SPI1_MEM_C_CK_IDLE_EDGE_V  0x00000001U
#define SPI1_MEM_C_CK_IDLE_EDGE_S  9
/** SPI1_MEM_C_CS_KEEP_ACTIVE : R/W; bitpos: [10]; default: 0;
 *  spi cs line keep low when the bit is set.
 */
#define SPI1_MEM_C_CS_KEEP_ACTIVE    (BIT(10))
#define SPI1_MEM_C_CS_KEEP_ACTIVE_M  (SPI1_MEM_C_CS_KEEP_ACTIVE_V << SPI1_MEM_C_CS_KEEP_ACTIVE_S)
#define SPI1_MEM_C_CS_KEEP_ACTIVE_V  0x00000001U
#define SPI1_MEM_C_CS_KEEP_ACTIVE_S  10

/** SPI1_MEM_C_TX_CRC_REG register
 *  SPI1 TX CRC data register.
 */
#define SPI1_MEM_C_TX_CRC_REG (DR_REG_FLASH_SPI1_BASE + 0x38)
/** SPI1_MEM_C_TX_CRC_DATA : RO; bitpos: [31:0]; default: 4294967295;
 *  For SPI1, the value of crc32.
 */
#define SPI1_MEM_C_TX_CRC_DATA    0xFFFFFFFFU
#define SPI1_MEM_C_TX_CRC_DATA_M  (SPI1_MEM_C_TX_CRC_DATA_V << SPI1_MEM_C_TX_CRC_DATA_S)
#define SPI1_MEM_C_TX_CRC_DATA_V  0xFFFFFFFFU
#define SPI1_MEM_C_TX_CRC_DATA_S  0

/** SPI1_MEM_C_CACHE_FCTRL_REG register
 *  SPI1 bit mode control register.
 */
#define SPI1_MEM_C_CACHE_FCTRL_REG (DR_REG_FLASH_SPI1_BASE + 0x3c)
/** SPI1_MEM_C_CACHE_USR_ADDR_4BYTE : R/W; bitpos: [1]; default: 0;
 *  For SPI1,  cache  read flash with 4 bytes address, 1: enable, 0:disable.
 */
#define SPI1_MEM_C_CACHE_USR_ADDR_4BYTE    (BIT(1))
#define SPI1_MEM_C_CACHE_USR_ADDR_4BYTE_M  (SPI1_MEM_C_CACHE_USR_ADDR_4BYTE_V << SPI1_MEM_C_CACHE_USR_ADDR_4BYTE_S)
#define SPI1_MEM_C_CACHE_USR_ADDR_4BYTE_V  0x00000001U
#define SPI1_MEM_C_CACHE_USR_ADDR_4BYTE_S  1
/** SPI1_MEM_C_FDIN_DUAL : R/W; bitpos: [3]; default: 0;
 *  For SPI1, din phase apply 2 signals. 1: enable 0: disable. The bit is the same with
 *  spi1_mem_c_fread_dio.
 */
#define SPI1_MEM_C_FDIN_DUAL    (BIT(3))
#define SPI1_MEM_C_FDIN_DUAL_M  (SPI1_MEM_C_FDIN_DUAL_V << SPI1_MEM_C_FDIN_DUAL_S)
#define SPI1_MEM_C_FDIN_DUAL_V  0x00000001U
#define SPI1_MEM_C_FDIN_DUAL_S  3
/** SPI1_MEM_C_FDOUT_DUAL : R/W; bitpos: [4]; default: 0;
 *  For SPI1, dout phase apply 2 signals. 1: enable 0: disable. The bit is the same
 *  with spi1_mem_c_fread_dio.
 */
#define SPI1_MEM_C_FDOUT_DUAL    (BIT(4))
#define SPI1_MEM_C_FDOUT_DUAL_M  (SPI1_MEM_C_FDOUT_DUAL_V << SPI1_MEM_C_FDOUT_DUAL_S)
#define SPI1_MEM_C_FDOUT_DUAL_V  0x00000001U
#define SPI1_MEM_C_FDOUT_DUAL_S  4
/** SPI1_MEM_C_FADDR_DUAL : R/W; bitpos: [5]; default: 0;
 *  For SPI1, address phase apply 2 signals. 1: enable 0: disable.  The bit is the same
 *  with spi1_mem_c_fread_dio.
 */
#define SPI1_MEM_C_FADDR_DUAL    (BIT(5))
#define SPI1_MEM_C_FADDR_DUAL_M  (SPI1_MEM_C_FADDR_DUAL_V << SPI1_MEM_C_FADDR_DUAL_S)
#define SPI1_MEM_C_FADDR_DUAL_V  0x00000001U
#define SPI1_MEM_C_FADDR_DUAL_S  5
/** SPI1_MEM_C_FDIN_QUAD : R/W; bitpos: [6]; default: 0;
 *  For SPI1, din phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with spi1_mem_c_fread_qio.
 */
#define SPI1_MEM_C_FDIN_QUAD    (BIT(6))
#define SPI1_MEM_C_FDIN_QUAD_M  (SPI1_MEM_C_FDIN_QUAD_V << SPI1_MEM_C_FDIN_QUAD_S)
#define SPI1_MEM_C_FDIN_QUAD_V  0x00000001U
#define SPI1_MEM_C_FDIN_QUAD_S  6
/** SPI1_MEM_C_FDOUT_QUAD : R/W; bitpos: [7]; default: 0;
 *  For SPI1, dout phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with spi1_mem_c_fread_qio.
 */
#define SPI1_MEM_C_FDOUT_QUAD    (BIT(7))
#define SPI1_MEM_C_FDOUT_QUAD_M  (SPI1_MEM_C_FDOUT_QUAD_V << SPI1_MEM_C_FDOUT_QUAD_S)
#define SPI1_MEM_C_FDOUT_QUAD_V  0x00000001U
#define SPI1_MEM_C_FDOUT_QUAD_S  7
/** SPI1_MEM_C_FADDR_QUAD : R/W; bitpos: [8]; default: 0;
 *  For SPI1, address phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with spi1_mem_c_fread_qio.
 */
#define SPI1_MEM_C_FADDR_QUAD    (BIT(8))
#define SPI1_MEM_C_FADDR_QUAD_M  (SPI1_MEM_C_FADDR_QUAD_V << SPI1_MEM_C_FADDR_QUAD_S)
#define SPI1_MEM_C_FADDR_QUAD_V  0x00000001U
#define SPI1_MEM_C_FADDR_QUAD_S  8

